{
    "home": "Home",
    "bridge": "Bridge",
    "developers": "Developers",
    "community": "Community", 
    "documentation": "Documentation",
    "white_paper":"White Paper",
    "explorer": "Explorer",
    "faucet": "Faucet",
    "slogan_title": "Universal Layer2 Scaling Solution ready for any EVM-based Chain",
    "slogan_desc": "Goshen is a fully Ethereum-equivalent L2 blockchain that makes it easier and inherently more secure to scale.",
    "advantage_title": "It is highly scalable, low-cost, secure and decentralized.",
    "ad_sub_title_1": "Low gas",
    "ad_sub_desc_1": "Computation for transaction execution is offloaded from L1 and the gas fees are therefore orders of magnitude cheaper.",
    "ad_sub_title_2": "Inherently secure",
    "ad_sub_desc_2": "All L2 state transitions are reproducible and verifiable on L1. Malicious behavior can be challenged by any honest validator.",
    "ad_sub_title_3": "Fast transactions",
    "ad_sub_desc_3": "L1 computation resources are limited, and transactions may be pending for a long time before getting processed. Transactions will be mined in second on Goshen network!",
    "ad_sub_title_4": "Developer friendly",
     "ad_sub_desc_4": "Fully EVM-equivalent so all L1 toolchains works out of the box. Developers can migrate Dapps smoothly from L1 and deploy directly on Goshen in most cases.",
    "faucet_title": "If You Need ETH, USDT, USDC TestNet Token, Please Apply Here.",
    "faucet_desc": "You will receive the following TestNet tokens instantly once you submit your wallet address:",
    "token_number": "5 ETH, 100 USDT, 100 USDC",
    "testNet_address": "TestNet Address",
    "place_desc":"Enter your TestNet address",
    "apply": "Apply",
    "no_address": "Please Enter Address",
    "apply_success": "Apply Success!",
    "apply_fail": "Apply Failed!",
    "discord": "Discord",
    "twitter": "Twitter",
    "blog": "Blog",
    "docs": "Docs",
    "subtitle1": "Secure scaling, easy for builders",
    "subtitle1_desc_1": "Goshen is a universal and fully Ethereum-equivalent Optimistic rollup L2 blockchain based on a RISC-V fraud-proof system that’s optimized for general-purpose EVM computation. It’s built on top of Ethereum, the most secure and battle-tested programmable blockchain, to maintain decentralization and security.",
    "subtitle1_desc_2": "Goshen feels the same as interacting with Ethereum, but faster and with transaction costs at a fraction of what they are on L1. It’s compatible with your favorite Ethereum tools and you can deploy Ethereum contracts directly without having to worry about security and compatibility.",
    "start_building": "Start building",
    "meet_us_on_discord": "Meet us on Discord",
    "subtitle2": "Build with us, we got you covered!",
    "subtitle3": "Our technology",
    "technology_title": "What sets Goshen apart from other Optimistic rollups",
    "technology_desc_1": "RISC-V instruction set",
    "technology_desc_2": "State transition implemented in Rust",
    "technology_desc_3": "Ethereum-equivalent",
    "technology_desc_4": "Collaborative interactive challenge fraud proof",
    "technology_ad_title_1": "Robust fraud proof system",
    "technology_ad_desc_1": "We introduce collaborative interactive challenge to our fraud proof system. It can deal with various types of attacks while maintaining simplicity of the protocol.",
    "technology_ad_title_2": "Efficient state transition",
    "technology_ad_desc_2": "We have implemented an efficient L2 state transition function, which can reduce off-chain computation and speed up interactive challenge on-chain.",
    "technology_ad_title_3": "Modular protocol design",
    "technology_ad_desc_3": "Our protocol adopts a layered design, and its simplicity makes it easy to understand. The implementation greatly reuses community toolchains of RISC-V, Rust and Ethereum, which can effectively reduce the risk of introducing vulnerabilities.",
    "roadmap": "Roadmap",
    "road_title_1": "Ethereum-equivalent local TestNet",
    "road_title_2": "Ethereum-equivalent Goerli Testnet",
    "road_title_3": "Rollup data compression",
    "road_title_4": "Open Ethereum Mainnet",
    "road_title_5": "Ethereum data blobs support",
    "road_title_6": "Collaborative interactive challenge fraud proof",
    "road_title_7": "Decentralized sequencer and more efficient protocol",
    "road_title_8": "Ethereum data sharding",
    "slog_desc1": "Goshen is an universal and fully Ethereum-equivalent Optimistic rollup L2 blockchain based on a RISC-V fraud-proof system optimized for general-purpose EVM computation. It’s built on top of Ethereum, the most secure and battle-tested programmable blockchain, in order to maintain decentralization and security.",
    "slog_desc2": "Goshen feels the same as interacting with Ethereum, but faster and with transaction costs at a fraction of what they are on L1. It’s compatible with your favorite Ethereum tools and you can deploy Ethereum contracts directly without having to worry about security and compatibility."
}
